0ld/publish/programacion/optimizar-fotos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2021-08-30 lun 17:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Optimizar fotos desde la terminal en Linux</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Galindo" />
<link rel="stylesheet" type="text/css" href="../style.css" />
<link rel="shortcut icon" type="image/jpg" href="../favicon.png"/>
<meta name="theme-color" content="#fff">
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no"/>
<div id="google_translate_element"></div></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Optimizar fotos desde la terminal en Linux
<br />
<span class="subtitle">Programación</span>
</h1>

<div id="outline-container-org8573a38" class="outline-2">
<h2 id="org8573a38">Accidentes</h2>
<div class="outline-text-2" id="text-org8573a38">
<p>
desde que empezó la pandemia me he visto en la necesidad de crear cientos de pdf que solo contienen fotos de mis trabajos. Pero una cosa que he notado en todo este tiempo es lo pesado que son los archivos que genera mi celular, rondando por internet me encontré con el siguiente comando para optimizar las fotos:
</p>

<pre class="example">

jpegoptim --size=500k *.jpg 

</pre>
</div>
</div>

<div id="outline-container-org98fe29e" class="outline-2">
<h2 id="org98fe29e">Extra, convertir fotos en pdfs</h2>
<div class="outline-text-2" id="text-org98fe29e">
<p>
Sí juntamos el comando anterior con el siguiente comando podemos generar pdf optimizados muy rápidamente (adiós www.ilovepdf.com).
</p>

<pre class="example">

convert *.jpg a.pdf

</pre>
</div>
</div>

<div id="outline-container-org78e2fff" class="outline-2">
<h2 id="org78e2fff">Final</h2>
<div class="outline-text-2" id="text-org78e2fff">
<pre class="example">

jpegoptim --size=500k *.jpg 
convert *.jpg a.pdf

</pre>
</div>
</div>
</div>
</body>
</html>
